/*
  Типы данных (значений) в C#

  +--------------+-----------------------------------+--------------+-------------------------------------------------------+
  |Ключевое слово|Тип                                |Размер в битах|Диапазон значений                                      |
  +--------------+-----------------------------------+--------------+-------------------------------------------------------+
  |bool          |Логический                         |              |                                                       |
  |byte          |8-разрядный целый без знака        |             8|                         0 -                        255|
  |char          |Символьный                         |              |                                                       |
  |decimal       |Числовой для финансовых вычислений |              |                                                       |
  |double        |С плавающей точкой двойной точности|            64|                    5E-324 - 1.7E+308                  |
  |float         |С плавающей точкой                 |            32|                   1.5E-45 - 3.4E+38                   |
  |int           |Целочисленный                      |            32|            -2 147 483 648 -              2 147 483 647|
  |long          |Длинное целое число                |            64|-9 223 372 036 854 775 808 -  9 223 372 036 854 775 807|
  |sbyte         |8-разрядный целый со знаком        |             8|                      -128 -                        127|
  |short         |Короткое целое                     |            16|                   -32 768 -                     32 767|
  |uint          |Целочисленный без знака            |            32|                         0 -              4 294 967 295|
  |ulong         |Длинное целое без знака            |            64|                         0 - 18 446 744 073 709 551 615|
  |ushort        |Короткое целое без знака           |            16|                         0 -                     65 535|
  +--------------+-----------------------------------+--------------+-------------------------------------------------------+
*/

